results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-512/ycsbwklde/CIPI_PERF.out
Setting g_min_fd 4 
Setting g_min_fd 4 
RocksDB:    version 5.4
Date:       Sun Mar  3 20:31:12 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklde    :     236.246 micros/op 4232 ops/sec; ( reads:101721 writes:5278 total:50000000 found:0)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklde --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 469.04
	System time (seconds): 302.77
	Percent of CPU this job got: 367%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:30.02
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1884272
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 1151
	Minor (reclaiming a frame) page faults: 1402653
	Voluntary context switches: 39351161
	Involuntary context switches: 4536
	Swaps: 0
	File system inputs: 169949448
	File system outputs: 35068944
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[80003.161254] sh (237703): drop_caches: 3
[80003.240827] sh (237714): drop_caches: 3
[80037.492549] write_proc_unbounded: Value of write = 1
[80037.492558] write_proc_2mb_limit: Value of write = 1
[80037.492563] write_proc_bitmap_shift: Value of write = 38
[80037.497688] write_proc_unbounded: Value of write = 1
[80037.497698] write_proc_2mb_limit: Value of write = 1
[80037.497702] write_proc_bitmap_shift: Value of write = 38
[80247.446882] write_proc_unbounded: Value of write = 0
[80247.446891] write_proc_2mb_limit: Value of write = 0
[80247.519884] write_proc_unbounded: Value of write = 0
[80247.519895] write_proc_2mb_limit: Value of write = 0